import 'package:fp/models/article_model.dart';


String userName = 'أحمد محمد';
String userAvatar= 'asset/user_avatar.png';

List<String> categories = [
  "أسرة",
  "مجلس الدولة",
  "جرائم إلكترونية",
  "قضاء عسكري",
  "تجاري وشركات",
  "عمال",
];


List<ArticleModel> articlesList =[ ArticleModel(
    label: ' المحامي والمحاماة',
    paragraph:'قالوا عن المحامى والمحاماة سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه .‏ قالوا عن المحامى يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها . من منكم يعرف السبب لماذا روب المحامي لونه هو اسود ؟ في عام 1791 وبالتحديد في فرنسا كان أحد القضاه الفرنسيون جالسا في شرفة منزله يستنشق الهواء وبالصدقه شاهد مشاجره بين شخصين انتهت بقتل احدهما وهرب الشخص القاتل … فاسرع احد الاشخاص الى مكان الجريمه واخذ القتيل وذهب به الى المستشفى لاسعافه ولكنه كان قد لفظ انفاسه الاخيره ومات فاتهمت الشرطه الشخص المنقذ وكان بريئا من هذه التهمه وللاسف فقد كان القاضي هو الذي سيحكم في القضيه وحيث ان القانون الفرنسي لا يعترف الا با لدلائل والقرائن . فقد حكم القاضي على الشخص البرئ بلاعدام . على الرغم ان القاضي نفسه هو شاهد على الجريمه التي وقعت امام منزله وبمرور الايام ظل القاضي يؤنب نفسه المعذبه بهذا الخطا الفادح ولكي يرتاح من عذاب الضمير . اعترف امام الرأي العام بانه اخطا في هذه القضيه وحكم على شخص برئ بالاعدام فثار الرأي العام ضده واتهم بانه ليس عنده امانه ولا ضمير وذات يوم اثناء النظر في احد القضايا وكان هذا القاضي هو نفسه رئيس المحكمه فوجد المحامي الذي وقف امامه لكي يترافع في القضيه مرتديا روب اسود فسأله القاضي : لماذا ترتدي هذا الروب الاسود؟ فقال له المحامي . لكي اذكرك بما فعلته من قبل وحكمت ظلما على شخص برئ بلاعدام ومنذ تلك الواقعه واصبح الروب الاسود هو الزي الرسمي في مهنة المحاماه ومن فرنسا انتقل الي سائر الدول. ذكاء محامٍ عندما كادت هيئة المحكمة أن تنطق بحكم الإعدام على رجل قتل زوجته والتى لم يعثروا علي جثتها ومع توافر الادلة التى تدين الزوج وقف محامي المتهم وكأنه يتعلق بالقشة لينقذ موكله وقبل النطق بالحكم وقف المحامى فقال انه لديه دليل قوي علي براءة موكله فقال ” الان سيدخل من باب المحكمة دليل قوي علي براءة موكلي وعلي ان زوجته حية ترزق …..” وفتح باب المحكمة واتجهة انظار كل من في القاعة الي الباب وبعد لحظات من الصمت والترقب لم يدخل احد من الباب وهنا قال المحامى ” الكل منتظر دخول القتيلة !!! وهذا يؤكد انه ليس لديكم يقين وقناعة مائة بالمائة بأن موكلي قتل زوجته وهنا هاجت القاعة إعجاباً بذكاء المحامى .. و تداول القضاة الموقف … و جاء الحكم المفاجأة …. حكم بالإعدام و بعد الحكم تساءل الناس كيف يصدر مثل هذا الحكم فرد القاضي ببساطة عندما أوحى المحامى لنا جميعاً بأن الزوجة لم تقتل ومازالت حية … توجهت أنظارنا جميعاً إلى الباب منتظرين دخولها إلا شخصاً واحداً في القاعة !!! انه الزوج ” المتهم !!!” لأنه يعلم جيداً أن زوجته قتلت … وأن الموتى لا يسيرون.'
    ,
    imageUrl:
    'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
    author: 'محمد محمود',
    date: DateTime.now()),


  ArticleModel(
      label: 'المحامون مثل الفيزيائيين',
      paragraph:
          'بعد دراسة الحقوق، وفي مهنة المحاماة على وجه الخصوص سأتمكّن من الدّفاع عن أيّ شخصٍ يلجأ إليّ لتخليصه من الظلم والجَور، وسأبذل كل جهدي لتخفيف آلام المعذبين من أصحاب التسلّط والهيمنة بغير وجه حقّ، فمن مميزات مهنة المحاماة أنها الوجهُ القويّ لإعطاء الحقّ لمن يستحقّ، ذلك مبدأ الكبار من القضاة والمحامين، وبهذا المبدأ تصبح المحاماةُ مهنة ذاتِ قداسةٍ لا يُستهانُ بها، لأنها تعيد لكلٍّ من الظالم والمظلوم مكانته وحقوقه، وتمنع الفساد من أن ينهشَ البلادَ والعباد، فيأكل الضعيف ويغذّي القويّ دون أي ضابطٍ يمنع طمَع القوي وجشعه وأكله لحقوق غيره. مهنة المحاماة تقتضي دراسة الشريعة التي تحكم بها البلاد، لأن القوانين التي تقوم عليها حكومة الدولة لا بدّ أن تكون تابعةً لخصائص دينٍ ما، وإن لم تكن كذلك لا بدَّ أن تكون تابعةً لقوانين السلامِ العالمي، إذ إنّ الانسلاخ عن التبَعيّةِ لدين من الأديان يقتضي أن تكون الأحكام موافقةً للطبيعة البشرية ومنصفةً لها، ولكن قد يتفاوتُ ذلك من دولةٍ لأخرى حسب البيئة وأمانة السلطة في تحديد القوانين. من الإنصافِ والحريّةِ بمكان أن تكون الدولة تابعةً للحكم الإسلاميّ الذي يعطي كلَّ ذي حقٍّ حقّه ويمنعه من ظلم الآخر، ويشدّد في عقوبة القاتل المتعمّد، ويمنع الثأر القبَليّ وقتل الإناثِ الذي كان سائدًا في المجتمعات العربية، ويحدّ من انتشار الفساد بضمان حقوق المرأةِ، ويحثّ على حفظ زوجها لها وضبطِ عملها ضمن قالبٍ يضمنُ سلامتها وكرامتها، كما يحثُّ على الزواج ولا يشترطُ له شروطًا قاسية، بل أقلَّ ما يستطيعه الإنسان لتوفير حياةٍ في نطاقها المُعتاد، ويجعلُ من فراق الزوجين أمرًا مسموحًا إن لم يكن ثمةً توافقٌ بينهما، ويضمن لكلّ منهما حقوقه بالإضافة إلى المحافظة على أطفالهما، فيمنعُ بذلك نظام الهجر بغير وجه حقّ، ويحدّ من الفساد الذي تجلبه العلاقات غير الشرعية. لقد وجدتُ في هذا الدين كلّ ما يحتاجه المرء ليكون إنسانًا سائرًا حسب ما تقتضيه فطرتُه السليمة وفكرهُ السليم وعيشه الكريم النافع لنفسه ولغيره، كما يجعل من الجماعات شعوبًا تدرك مفهوم الجماعة بصورته الأكمل، وتعين على التآزر والنهضة فيما بينهما، فتقومُ بأمر بعضها البعض وتحفظُ حقوقَ الجميع، وتعطي الحرّية للجميع بما يتناسب مع القانون العامّ الذي لا تؤثر فيه حريّة فردٍ على الآخر. كانَ أهم ما وجدته في نفسي من صفات المحامي الرغبة القوية في الانتصار للحقّ، وإماتةِ الظلم ودفنه بشتى وسائل الاندثار، فليس هناك أقبحُ من الظلم حين يُشرّد الناس ويأكل حقوقهم، ويقتل كبيرهم وصغيرهم، ويقهر ضعيفهم بسلب أهمّ الاحتياجات في الحياة منه، لتحقق هذه السرقات والتدمير والقتل والتشريد والمنع من أبسط حقوق الحياة مخططاتِ الدولِ القوية الجشِعة، وجيوب كبار التجار الذين يتاجرون بدماء الشعوب، وخزائن النفوس التي لا تشبع ولا تعلم أن لها يومًا من العذاب الشديد ينتظرها في ظلمة القبر. دراسة المحاماة تجعلني أستعيد رغبتي في الحياة بعد كلّ ما رأيته عبر شاشة التلفاز، وبعد كلّ ما ذرفتُه من دمع حُزنًا على أولئكَ الذين ينامونَ في الخيام في أشدّ أيام السنة بردًا، تحت الثلج، وأولئكَ الذين هبطَتْ عليهم الصواريخُ أثناء نومهم وهم بين أطفالهم، وأولئك الذي فُقِد لهم أبٌ فلم يعُد ولم يعلموا عنه شيئًا منذ سنوات، فضلًا عن أولئك الذين ذُبِحَ أمامهم أقرباؤهم ولم يستطيعوا أن يتفوّهوا بكلمة، لأنّهم يعلمون أنّ رقبتهم ستكون تحت السّكّين بعد دقائق.',
      imageUrl:
          'https://www.brainscape.com/academy/content/images/size/w620/2020/08/Newton-s-cradle-balls.jpeg',
      author: 'محمد ابراهيم',
      date: DateTime.now()),





  ArticleModel(
      label: 'الابتزاز الالكتروني',
      paragraph:
      'يعرف الابتزاز الإلكتروني على أنه عملية إجبار الشخص على القيام بعمل ما وتهديده بضرورة القيام به، أو ترهيبه بالقيام بعمل أم منعه مما ينوي القيام به. أي أن الابتزاز الإلكتروني هو عملية تهديد وترهيب للضحية، وذلك بنشر صور أو مواد مصورة أو تسريب معلومات سرية تخص الضحية، مقابل دفع مبالغ مالية أو استغلال الضحية للقيام بأعمال غير مشروعة لصالح (المبتزين) كالإفصاح عن معلومات سرية خاصة بجهة العمل أو غيرها من الأعمال غير القانونية. ويمس موضوع الابتزاز الإلكتروني وكذلك المخدرات عدة جوانب في حياة الناس والمجتمع، حيث يولد عنهما جرائم أخرى تمس الكثير من الفئات في المجتمع خاصة الأسر التي يتورط ابناءها في تلك القضايا. وقد تزايدت هذه القضايا في المجتمعات الخليجية مع وجود وسائل الاتصالات الحديثة والتقنيات المتطورة في عملية الاتصالات، وخاصة اليدوية منها. ويتضح من الأرقام بأن حوالي 57% ممن تبلغ أعمارهم ما بين 16 إلى 24 في السلطنة يتعاملون مع وسائل التواصل الاجتماعي من إجمالي الأشخاص الذين يمتلكون هذه الأجهزة. كما توضح بعض الإحصاءات المحلية أن 86% من العمانيين يستخدمون حسابات في الفيسبوك، و80% لديهم اتصالات عبر واتساب، في حين أن 40% لديهم حسابات في جوجل وانستجرام و36% في تويتر.. وهذه الأرقام لا تبتعد كثيرا عن بقية الدول الخليجية الأخرى، حيث جميع أبناء المنطقة لديهم حسابات في مواقع مماثلة. ومن خلال تلك النسب السابقة تتمكن الشركات العالمية من القيام بحملات ترويجية وتسويقية للمنتجات والسلع الجديدة، إلا أن بعض هذه الحسابات تستغل أيضا في مجالات أخرى كالابتزاز الالكتروني والترويج للمخدرات نتيجة لعدم معرفة الأشخاص بنوايا الذين يقومون بالاتصال معهم، الأمر الذي يتطلب من الناس عدم نشر جميع البيانات الخاصة بهم على وسائل التواصل الاجتماعي. وتشير البيانات إلى ارتفاع معدلات الابتزاز الإلكتروني عبر الإنترنت في السلطنة على مدى السنوات القليلة الماضية، حيث كان هناك بلاغان فقط في عام 2011 و2012، في حين ارتفع العدد إلى 5 بلاغات في عام 2013 ثم إلى 17 بلاغا في عام 2014. وفي عام 2015 سجلت الجهات الأمنية 84 حالة عن الابتزاز الإلكتروني، فيما بلغ عدد البلاغات في عام 2016 نحو 161 بلاغا، الأمر الذي يؤكد نجاح جهود التوعية تجاه هذه القضية. ويرى المسؤولون في هيئة تنظيم الاتصالات في السلطنة، وكذلك هيئة تقنية المعلومات أن الأرقام الفعلية قد تكون أعلى تلك التي تختص بمساعدة ضحايا الابتزاز عبر الإنترنت. علاوة على ذلك، يعتقدون أن العديد من الضحايا من الإناث التي قد تكون مترددة في الإبلاغ عن هذه الحالات بسبب الخوف من وصمة العار التي تعلق على القضية. لقد سنت الحكومة العمانية العديد من القوانين التي تعالج هذه القضايا ممن يستخدمون الشبكة المعلوماتية أو وسائل تقنية المعلومات بصورة خاطئة. كما تكللت الجهود بالحد من جرائم الابتزاز الإلكتروني في الفترة الأخيرة. وهناك العديد من الجهات الرسمية المعنية بإنشاء حملة تدور حول زيادة الوعى عن الابتزاز عبر الإنترنت. وهذه التوعية هدفها الإبلاغ عن الحوادث الخاصة بالابتزاز الإلكتروني للسلطات المسؤولة، فيما وعدت الجهات الحكومية بالقضاء على كل جرائم الابتزاز الإلكتروني بسرية عالية.',
      imageUrl:
      'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTrJn47Db5WZ5ud-S-ScIdoVLZzrrN2qeiWoU056ZHZhfjrgCe-dPJILXX1iHQypLDAYJU&usqp=CAU',
      author: 'محمد محمود',
      date: DateTime.now()),




];