import 'package:fp/models/article_model.dart';


String userName = 'أحمد محمد';
String userAvatar= 'asset/user_avatar.png';

List<String> categories = [
  "أسرة",
  "مجلس الدولة",
  "جرائم إلكترونية",
  "قضاء عسكري",
  "تجاري وشركات",
  "عمال",
];


List<ArticleModel> articlesList =[ ArticleModel(
    label: ' المحامي والمحاماة',
    paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
    imageUrl:
    'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
    author: 'محمد محمود',
    date: DateTime.now()),
  ArticleModel(
      label: ' اقتراب القوانين بالواقع',
      paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
      imageUrl:
      'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
      author: 'المحامون مثل الفزيائيين',
      date: DateTime.now()),
  ArticleModel(
      label: ' المحامي والمحاماة',
      paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
      imageUrl:
      'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
      author: 'محمد محمود',
      date: DateTime.now()),
  ArticleModel(
      label: ' المحامي والمحاماة',
      paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
      imageUrl:
      'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
      author: 'محمد محمود',
      date: DateTime.now()),
  ArticleModel(
      label: ' المحامي والمحاماة',
      paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
      imageUrl:
      'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
      author: 'محمد محمود',
      date: DateTime.now()),
  ArticleModel(
      label: ' المحامي والمحاماة',
      paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
      imageUrl:
      'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
      author: 'محمد محمود',
      date: DateTime.now()),
  ArticleModel(
      label: ' المحامي والمحاماة',
      paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
      imageUrl:
      'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
      author: 'محمد محمود',
      date: DateTime.now()),
  ArticleModel(
      label: ' المحامي والمحاماة',
      paragraph:'سمة المحاماة الأولى هي الوقار, فإن فقد المحامي وقاره, فقد موكله, وفقد قضيته, وفقد قاضيه, وفقد نفسه. إن المحامي البارع ينبغي أن يكون واسع الإيحاء للقاضي بالحجج الكفيلة لكسب القضية وأن يكون هذا الإيحاء من المهارة والكياسة بحيث يشعر القاضي أن هذه الحجج هي التي يؤمن بها وأن ينسى دور المحامي في تصديرها إليه يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها يولد المحامي محامياً, أما القاضي فتصنعه الأيام إن وظيفة المحامي تتطلب من العبقرية والخيال أكثر مما تطلبه وظيفة القاضي, إذ لاشك أن التوفيق إلى استنباط الحجج القوية المؤثرة في الدعوى أصعب فنياً من مجرد اختيار الحجج المناسبة المقدمة من الطرفين لتأسيس الحكم عليها .',
      imageUrl:
      'https://verobeachinjurylaw.com/wp-content/uploads/2021/03/Criminal-Defense-Lawyer-Vero-Beach-FL-300x200.jpg',
      author: 'محمد محمود',
      date: DateTime.now()),

];